OpenFOAM_Maincode/tutorials/incompressibleDriftFlux/tank3D/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    model    buoyantKEpsilon;

    turbulence      on;
    printCoeffs     on;

    buoyantKEpsilonCoeffs
    {
        Cg      0.85;
    }
}

// ************************************************************************* //
